intyg/clinicalprocess-healthcond-rehabilitation/schemas/interactions/ListActiveSickLeavesForCareUnitInteraction/ListActiveSickLeavesForCareUnitInteraction_1.0_RIVTABP21.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='ListActiveSickLeavesForCareUnitInteraction' xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' xmlns:xs='http://www.w3.org/2001/XMLSchema' xmlns:tjsr='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitResponder:1' xmlns:tjsi='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitInitiator:1' xmlns:tns='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnit:1:rivtabp21' targetNamespace='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnit:1:rivtabp21' xmlns:itr='urn:riv:itintegration:registry:1'>
  <xs:annotation>
    <xs:documentation>
			 Tjänsteinteraktionens namn: ListActiveSickLeavesForCareUnitInteraction
			 Beskrivning: 
			   Hantera ordinations- och förskrivningsrelaterat utfall av aktivitet
			 Revisioner: 
			 Tjänstedomän: clinicalprocess:healthcond:rehabilitation
			 Tjänsteinteraktionstyp: Fråga-Svar
			 WS-profil: RIVTABP21
			 Förvaltas av: Sveriges Kommuner och Landsting
			 </xs:documentation>
  </xs:annotation>
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnit:1:rivtabp21'>
      <xs:import schemaLocation='ListActiveSickLeavesForCareUnitResponder_1.0.xsd' namespace='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitResponder:1' />
      <xs:import schemaLocation='../../core_components/itintegration_registry_1.0.xsd' namespace='urn:riv:itintegration:registry:1' />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name='ListActiveSickLeavesForCareUnitRequest'>
    <wsdl:part name='LogicalAddress' element='itr:LogicalAddress'>
      <wsdl:documentation>The organisation number of the receiving insurance institution</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:ListActiveSickLeavesForCareUnit' />
  </wsdl:message>
  <wsdl:message name='ListActiveSickLeavesForCareUnitResponse'>
    <wsdl:part name='parameters' element='tjsr:ListActiveSickLeavesForCareUnitResponse' />
  </wsdl:message>
  <wsdl:portType name='ListActiveSickLeavesForCareUnitResponderInterface'>
    <wsdl:operation name='ListActiveSickLeavesForCareUnit'>
      <wsdl:input message='tns:ListActiveSickLeavesForCareUnitRequest' />
      <wsdl:output message='tns:ListActiveSickLeavesForCareUnitResponse' />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name='ListActiveSickLeavesForCareUnitResponderBinding' type='tns:ListActiveSickLeavesForCareUnitResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='ListActiveSickLeavesForCareUnit'>
      <soap:operation soapAction='urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitResponder:1:ListActiveSickLeavesForCareUnit' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:ListActiveSickLeavesForCareUnitRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name='ListActiveSickLeavesForCareUnitResponderService'>
    <wsdl:port name='ListActiveSickLeavesForCareUnitResponderPort' binding='tns:ListActiveSickLeavesForCareUnitResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>