performanceTests/src/gatling/resources/bodies/list-active-sick-leaves.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright (C) 2016 Inera AB (http://www.inera.se)
  ~
  ~ This file is part of sklintyg (https://github.com/sklintyg).
  ~
  ~ sklintyg is free software: you can redistribute it and/or modify
  ~ it under the terms of the GNU General Public License as published by
  ~ the Free Software Foundation, either version 3 of the License, or
  ~ (at your option) any later version.
  ~
  ~ sklintyg is distributed in the hope that it will be useful,
  ~ but WITHOUT ANY WARRANTY; without even the implied warranty of
  ~ MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
  ~ GNU General Public License for more details.
  ~
  ~ You should have received a copy of the GNU General Public License
  ~ along with this program.  If not, see <http://www.gnu.org/licenses/>.
  -->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:urn="urn:riv:clinicalprocess:healthcond:rehabilitation:ListActiveSickLeavesForCareUnitResponder:1"
xmlns:urn1="urn:riv:clinicalprocess:healthcond:certificate:types:2"
xmlns:urn2="urn:riv:itintegration:registry:1">
   <soapenv:Header>
      <urn2:LogicalAddress>Test</urn2:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn:ListActiveSickLeavesForCareUnit>
         <urn:enhets-id>
            <urn1:root></urn1:root>
            <urn1:extension>${enhetsId}</urn1:extension>
         </urn:enhets-id>
      </urn:ListActiveSickLeavesForCareUnit>
   </soapenv:Body>
</soapenv:Envelope>
